# LIMPIEZA DE DATOS

In [2]:
import pandas as pd

In [28]:
datos = {"Nombre":["Maria","Jose","Leandro"],
        "Edad":[25,24,22],
        "Salario":[50000,60000,75000]}

df = pd.DataFrame(datos)

df

    Nombre  Edad  Salario
0    Maria    25    50000
1     Jose    24    60000
2  Leandro    22    75000

In [7]:
#Verifica si hay valores nulos y devuelve la mascara booleana 
#True si hay valores nulos,false si no hay valores nulos

df.isna()

   Nombre   Edad  Salario
0   False  False    False
1   False  False    False
2   False  False    False

In [8]:
#Otra forma si hay valores nulos

df.isnull()

   Nombre   Edad  Salario
0   False  False    False
1   False  False    False
2   False  False    False

In [10]:
#Verifica si los valores en un objeto no son nulos y devuelve una mascara booleana indicando las posiciones de los valores no nulos

df.notna()

   Nombre  Edad  Salario
0    True  True     True
1    True  True     True
2    True  True     True

In [14]:
#Otra forma de hacerlo 

df.notnull()

   Nombre  Edad  Salario
0    True  True     True
1    True  True     True
2    True  True     True

In [13]:
#Devuelve un arreglo con los valores unicos en el objeto

df["Edad"].unique()

array([25, 24, 22], dtype=int64)

In [15]:
#Devuelve un valor booleano si tienes valores nulos

df["Salario"].hasnans

False

In [16]:
#Elimina filas o columnas con valores nulos del DataFrame

df.dropna()

    Nombre  Edad  Salario
0    Maria    25    50000
1     Jose    24    60000
2  Leandro    22    75000

In [17]:
#Rellena los valores nulos en un dataframe con el valor especifico

df.fillna(0)

    Nombre  Edad  Salario
0    Maria    25    50000
1     Jose    24    60000
2  Leandro    22    75000

In [18]:
#Realiza una interpolacion lineal para llenar los valores nulos en una serie
df["Salario"].interpolate()

0    50000
1    60000
2    75000
Name: Salario, dtype: int64

In [19]:
#Elimina filas duplicadas del dataframe en todas las columnas

df.drop_duplicates()

    Nombre  Edad  Salario
0    Maria    25    50000
1     Jose    24    60000
2  Leandro    22    75000

In [20]:
#Devuelve una mascara booleana que indica filas duplicadas del Dataframe

df.duplicated()

0    False
1    False
2    False
dtype: bool

In [21]:
#Verifica si los valores en una serie estan en orden monotonico (creciente o decreciente)

df["Edad"].is_monotonic_increasing

False

In [22]:
#Devuelve un arreglo con las posiciones de los elementos no nulos en una serie

df["Edad"].to_numpy().nonzero()

(array([0, 1, 2], dtype=int64),)

In [29]:
#Elimina filas o columnas del dataframe en funcion de etiquetas o posiciones

df.drop(columns = ["Salario"],inplace = True)

In [31]:
#Exportacion 

df.to_csv("Limpieza_de_datos_simple.csv",index = False)